src/load-tests/reports/summary_user_load_testing6.txt
config:
  target: "http://localhost:3000"  
  phases:
    - name: Minimum Load
      duration: 60
      arrivalRate: 5
    - name: Moderate Load
      duration: 120
      arrivalRate: 10
    - name: High Load
      duration: 120
      arrivalRate: 50
  
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create and fetch users"
    flow:
      - post:
          url: "/users"
          json:
            username: "test_{{ $randomString(8) }}"
            email: "test_{{ $randomString(8) }}@g.ucla.edu"
            password: "Password123!"

-----------------------------------------------------------------------------------------------------------------------


All VUs finished. Total time: 5 minutes, 17 seconds

--------------------------------
Summary report @ 21:00:42(-0800)
--------------------------------

errors.ETIMEDOUT: .............................................................. 6500
http.codes.201: ................................................................ 1000
http.downloaded_bytes: ......................................................... 64000
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 7500
http.response_time:
  min: ......................................................................... 266
  max: ......................................................................... 1789
  mean: ........................................................................ 345.7
  median: ...................................................................... 308
  p95: ......................................................................... 539.2
  p99: ......................................................................... 1224.4
http.response_time.2xx:
  min: ......................................................................... 266
  max: ......................................................................... 1789
  mean: ........................................................................ 345.7
  median: ...................................................................... 308
  p95: ......................................................................... 539.2
  p99: ......................................................................... 1224.4
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 1000
vusers.created: ................................................................ 7500
vusers.created_by_name.Create and fetch users: ................................. 7500
vusers.failed: ................................................................. 6500
vusers.session_length:
  min: ......................................................................... 267.4
  max: ......................................................................... 1792.6
  mean: ........................................................................ 347.7
  median: ...................................................................... 308
  p95: ......................................................................... 539.2
  p99: ......................................................................... 1249.1
Log file: src/load-tests/reports/user_load_testing6.json