src/load-tests/reports/summary_user_load_testing7.txt
config:
  target: "http://localhost:3000"  
  phases:
    - name: Moderate High Load
      duration: 60
      arrivalRate: 20  
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create and fetch users"
    flow:
      - post:
          url: "/users"
          json:
            username: "test_{{ $randomString(8) }}"
            email: "test_{{ $randomString(8) }}@g.ucla.edu"
            password: "Password123!"

-----------------------------------------------------------------------------------------------------------------------

All VUs finished. Total time: 1 minute, 10 seconds

--------------------------------
Summary report @ 21:12:05(-0800)
--------------------------------

errors.ETIMEDOUT: .............................................................. 257
http.codes.201: ................................................................ 943
http.downloaded_bytes: ......................................................... 60352
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 1200
http.response_time:
  min: ......................................................................... 436
  max: ......................................................................... 9992
  mean: ........................................................................ 5121.6
  median: ...................................................................... 5168
  p95: ......................................................................... 9607.1
  p99: ......................................................................... 9999.2
http.response_time.2xx:
  min: ......................................................................... 436
  max: ......................................................................... 9992
  mean: ........................................................................ 5121.6
  median: ...................................................................... 5168
  p95: ......................................................................... 9607.1
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 943
vusers.completed: .............................................................. 943
vusers.created: ................................................................ 1200
vusers.created_by_name.Create and fetch users: ................................. 1200
vusers.failed: ................................................................. 257
vusers.session_length:
  min: ......................................................................... 450
  max: ......................................................................... 9992.7
  mean: ........................................................................ 5123.2
  median: ...................................................................... 5168
  p95: ......................................................................... 9607.1
  p99: ......................................................................... 9999.2
Log file: src/load-tests/reports/user_load_testing7.json