src/load-tests/reports/summary_user_load_testing8.txt
config:
  target: "http://localhost:3000"  
  phases:
    - name: Moderate Load
      duration: 300
      arrivalRate: 10  
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create and fetch users"
    flow:
      - post:
          url: "/users"
          json:
            username: "test_{{ $randomString(8) }}"
            email: "test_{{ $randomString(8) }}@g.ucla.edu"
            password: "Password123!"
  
  -----------------------------------------------------------------------------------------------------------------------

All VUs finished. Total time: 5 minutes, 2 seconds

--------------------------------
Summary report @ 21:21:06(-0800)
--------------------------------

http.codes.201: ................................................................ 3000
http.downloaded_bytes: ......................................................... 192000
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 3000
http.response_time:
  min: ......................................................................... 266
  max: ......................................................................... 1504
  mean: ........................................................................ 314.2
  median: ...................................................................... 308
  p95: ......................................................................... 361.5
  p99: ......................................................................... 507.8
http.response_time.2xx:
  min: ......................................................................... 266
  max: ......................................................................... 1504
  mean: ........................................................................ 314.2
  median: ...................................................................... 308
  p95: ......................................................................... 361.5
  p99: ......................................................................... 507.8
http.responses: ................................................................ 3000
vusers.completed: .............................................................. 3000
vusers.created: ................................................................ 3000
vusers.created_by_name.Create and fetch users: ................................. 3000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 267.4
  max: ......................................................................... 1506
  mean: ........................................................................ 315.9
  median: ...................................................................... 308
  p95: ......................................................................... 368.8
  p99: ......................................................................... 507.8
Log file: src/load-tests/reports/user_load_testing8.json